In [1]:
import pandas as pd
df = pd.read_csv("example.csv")
print(df)

      Name  Age          City  Salary
0    Alice   25      New York   70000
1      Bob   30   Los Angeles   80000
2  Charlie   35       Chicago   90000
3    David   40       Houston   85000
4      Eva   22       Phoenix   60000
5    Frank   28  Philadelphia   75000
6    Grace   32   San Antonio   82000
7   Hannah   27     San Diego   78000
8      Ian   45        Dallas   95000
9     Jane   31      San Jose   83000

In [2]:
df = pd.read_csv('/data/example.csv')

FileNotFoundError: [Errno 2] No such file or directory: '/data/example.csv'

In [3]:
df = pd.read_excel('example.xlsx')
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [4]:
df = pd.read_csv('example.csv', usecols=['Name', 'Age'])
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eva   22
5    Frank   28
6    Grace   32
7   Hannah   27
8      Ian   45
9     Jane   31

In [5]:
df = pd.read_csv('example_no_header.csv', header=None)
print(df)

         0   1             2      3
0    Alice  25      New York  70000
1      Bob  30   Los Angeles  80000
2  Charlie  35       Chicago  90000
3    David  40       Houston  85000
4      Eva  22       Phoenix  60000
5    Frank  28  Philadelphia  75000
6    Grace  32   San Antonio  82000
7   Hannah  27     San Diego  78000
8      Ian  45        Dallas  95000
9     Jane  31      San Jose  83000

In [8]:
df = pd.read_csv('example_no_header.csv', usecols=[0])
print(df)

     Alice
0      Bob
1  Charlie
2    David
3      Eva
4    Frank
5    Grace
6   Hannah
7      Ian
8     Jane

In [9]:
######

In [10]:
import pandas as pd

In [12]:
df = pd.read_csv('example.csv')
print(df.head())
df.head(3)

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000
3    David   40      Houston   85000
4      Eva   22      Phoenix   60000

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [14]:
import pandas as pd 
df = pd.read_csv('example.csv')
print(df.tail())
print(df.tail(3))
df.tail(3)

     Name  Age          City  Salary
5   Frank   28  Philadelphia   75000
6   Grace   32   San Antonio   82000
7  Hannah   27     San Diego   78000
8     Ian   45        Dallas   95000
9    Jane   31      San Jose   83000
     Name  Age       City  Salary
7  Hannah   27  San Diego   78000
8     Ian   45     Dallas   95000
9    Jane   31   San Jose   83000

     Name  Age       City  Salary
7  Hannah   27  San Diego   78000
8     Ian   45     Dallas   95000
9    Jane   31   San Jose   83000

In [15]:
print(df.describe())

             Age        Salary
count  10.000000     10.000000
mean   31.500000  79800.000000
std     6.948221   9953.223933
min    22.000000  60000.000000
25%    27.250000  75750.000000
50%    30.500000  81000.000000
75%    34.250000  84500.000000
max    45.000000  95000.000000

In [16]:
print(df.describe(include='all'))

         Name        Age      City        Salary
count      10  10.000000        10     10.000000
unique     10        NaN        10           NaN
top     Alice        NaN  New York           NaN
freq        1        NaN         1           NaN
mean      NaN  31.500000       NaN  79800.000000
std       NaN   6.948221       NaN   9953.223933
min       NaN  22.000000       NaN  60000.000000
25%       NaN  27.250000       NaN  75750.000000
50%       NaN  30.500000       NaN  81000.000000
75%       NaN  34.250000       NaN  84500.000000
max       NaN  45.000000       NaN  95000.000000

In [17]:
df.shape

(10, 4)

In [5]:
import pandas as pd
df = pd.read_csv('example.csv')
print(df['Age'].mean())
print(df['Salary'].mean())
print(df[['Age', 'Salary']].mean())

31.5
79800.0
Age          31.5
Salary    79800.0
dtype: float64

In [6]:
print(df.max())
print(df['Salary'].max())

Name          Jane
Age             45
City      San Jose
Salary       95000
dtype: object
95000

In [7]:
print(df.min())
print(df['Age'].min())

Name        Alice
Age            22
City      Chicago
Salary      60000
dtype: object
22

In [9]:
print(df.sum())
print(df.sum(numeric_only=True))

Name         AliceBobCharlieDavidEvaFrankGraceHannahIanJane
Age                                                     315
City      New YorkLos AngelesChicagoHoustonPhoenixPhilad...
Salary                                               798000
dtype: object
Age          315
Salary    798000
dtype: int64

In [1]:
import pandas as pd
df = pd.read_csv('example.csv')
print(df.head(7))
print(df.describe())
df.shape

      Name  Age          City  Salary
0    Alice   25      New York   70000
1      Bob   30   Los Angeles   80000
2  Charlie   35       Chicago   90000
3    David   40       Houston   85000
4      Eva   22       Phoenix   60000
5    Frank   28  Philadelphia   75000
6    Grace   32   San Antonio   82000
             Age        Salary
count  10.000000     10.000000
mean   31.500000  79800.000000
std     6.948221   9953.223933
min    22.000000  60000.000000
25%    27.250000  75750.000000
50%    30.500000  81000.000000
75%    34.250000  84500.000000
max    45.000000  95000.000000

(10, 4)